#1. Є дев'ятиповерховий будинок, в якому 4 під'їзди. Номер під'їзду починається з одиниці.
# На одному поверсі - 4 квартири. Напишіть програму, яка від користувача отримує номер квартири
# та виводить для заданої квартири номер під'їзду, поверху та номер на поверсі.
# Якщо такої квартира немає в цьому будинку, то необхідно повідомити користувача про це.
a = int(input('Введіть номер квартири: '))
if a < 145:
    if a >= 109:
        print('4-й підїзд')
        if a >= 141:
            print(f'9-й поверх\nквартира {a}')
        elif a >= 137:
            print(f'8-й поверх\nквартира {a}')
        elif a >= 133:
            print(f'7-й поверх\nквартира {a}')
        elif a >= 129:
            print(f'6-й поверх\nквартира {a}')
        elif a >= 125:
            print(f'5-й поверх\nквартира {a}')
        elif a >= 121:
            print(f'4-й поверх\nквартира {a}')
        elif a >= 117:
            print(f'3-й поверх\nквартира {a}')
        elif a >= 113:
            print(f'2-й поверх\nквартира {a}')
        else:
            print(f'1-й поверх\nквартира {a}')
    elif a >= 73:
        print('3-й підїзд')
        if a >= 105:
            print(f'9-й поверх\nквартира {a}')
        elif a >= 101:
            print(f'8-й поверх\nквартира {a}')
        elif a >= 97:
            print(f'7-й поверх\nквартира {a}')
        elif a >= 93:
            print(f'6-й поверх\nквартира {a}')
        elif a >= 89:
            print(f'5-й поверх\nквартира {a}')
        elif a >= 85:
            print(f'4-й поверх\nквартира {a}')
        elif a >= 81:
            print(f'3-й поверх\nквартира {a}')
        elif a >= 77:
            print(f'2-й поверх\nквартира {a}')
        else:
            print(f'1-й поверх\nквартира {a}')
    elif a >= 37:
        print('2-й підїзд')
        if a >= 69:
            print(f'9-й поверх\nквартира {a}')
        elif a >= 65:
            print(f'8-й поверх\nквартира {a}')
        elif a >= 61:
            print(f'7-й поверх\nквартира {a}')
        elif a >= 57:
            print(f'6-й поверх\nквартира {a}')
        elif a >= 53:
            print(f'5-й поверх\nквартира {a}')
        elif a >= 49:
            print(f'4-й поверх\nквартира {a}')
        elif a >= 45:
            print(f'3-й поверх\nквартира {a}')
        elif a >= 41:
            print(f'2-й поверх\nквартира {a}')
        else:
            print(f'1-й поверх\nквартира {a}')
    elif a >= 1:
        print('1-й підїзд')
        if a >= 33:
            print(f'9-й поверх\nквартира {a}')
        elif a >= 29:
            print(f'8-й поверх\nквартира {a}')
        elif a >= 25:
            print(f'7-й поверх\nквартира {a}')
        elif a >= 21:
            print(f'6-й поверх\nквартира {a}')
        elif a >= 17:
            print(f'5-й поверх\nквартира {a}')
        elif a >= 13:
            print(f'4-й поверх\nквартира {a}')
        elif a >= 9:
            print(f'3-й поверх\nквартира {a}')
        elif a >= 5:
            print(f'2-й поверх\nквартира {a}')
        else:
            print(f'1-й поверх\nквартира {a}')
    else:
        print('В цьому будинку немає такої квартири')
else:
    print('В цьому будинку немає такої квартири')

#2.Написати програму, яка буде повертати для заданого року кількість днів.
# Рік є високосним, якщо він кратний 4, але не кратний 100, а також якщо він кратний 400
a = int(input('введіть рік:'))
if a%4 and a%400:
    print ('365 днів')
else:
    print('366 днів. Висикосний!')

#.3  Трикутник існує лише тоді, коли сума будь-яких двох сторін більше третьої.
# Дано: A, B, C - сторони трикутника. Напишіть програму, яка вказує чи існує такий трикутник.

a = int(input('сторона а:'))
b = int(input('сторона b:'))
c = int(input('сторона c:'))
if a > b + c or b > a + c or c > a + b:
    print('такий трикутник існує!')
else:
    print(('такого трикутника неіснує'))


