# 1. Написати Python-скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.
for i in range(0,100, 7):
    if i != 0:
        print(i)
# 2. Написати Python-скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).
n = int(input('n: '))
j = 1
for i in range(n):
    j =j*(i+1)
print(f'factorial: {j}')
# 3. Написати Python-скрипт, який виводить на екран таблицю множення на 5.
# Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...
for i in range(10):
    i += 1
    print(f'{i} * 5 = {i*5}')
# 4. Написати Python-скрипт, який виводить на екран прямокутник із '*'. Висота і ширина прямокутника вводяться з клавіатури.
#  Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.
# *****
# *      *
# *      *
# *****
a = int(input('Висота: '))
b = int(input('Ширина: '))
for i in range(a):
    if i == 1:
        print('*' * b)
    if i < (a-1) and i != 0:
        print('*' +' ' * (b-2) + '*')
    if i == (a-1):
        print('*' * b)
# 5. Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.
x = [0, 5, 2, 4, 7, 1, 3, 19]
y = []
for i in x:
    if i % 2 == 1:
        y.append(i)
print(len(y))
# 6. Створіть список випадкових чисел (розміром 4 елементи). Створіть другий список у два рази більше першого,
# де перші 4 елементи повинні дорівнювати елементам першого списку, а решта елементів - подвоєним значенням початкових.
# Наприклад,
# Було → [1,4,7,2]
# Стало → [1,4,7,2,2,8,14,4]
import random
x = random.randrange(1, 50)
x1 = random.randrange(1, 50)
x2 = random.randrange(1, 50)
x3 = random.randrange(1, 50)
y = [x, x1, x2, x3]
y1 = []
for i in y:
    y1.append(i)
for i in y:
    y1.append(i*i)
print('Було: 'f'{y}')
print('Стало: 'f'{y1}')
# 7. Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.
import random
x = []
for i in range(12):
    x.append(random.randrange(10000, 15000))
    print(x[i])
print('середньомісячна зарплата: '+f'{sum(x)/12}')
# 8. Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9,10, 11, 12]
# [13,14, 15, 16]
# Напишіть Python-скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.
x = [[1, 2, 3, 4],[5, 6, 7, 8],[9,10, 11, 12],[13,14, 15, 16]]
for i in x:
    print(i)
else:
    y = sum(x[0]+x[1]+x[2]+x[3])
    print(y)
# 9. Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].
# Список може бути довільною довжиною.
x = [7,2,9,4]
y = []
for i in x:
    y.append(i)
y.reverse()
print(x,' -> ',y)
# 10. За допомогою циклів вивести на екран усі прості числа від 1 до 100.
for i in range (2, 100):
    x = True
    for j in range (2, i):
        if i % j == 0:
            x = False
            break
    if x:
        print(i)
# 11. Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне).
# У прикладі ширина дорівнює 5.
# *****
#  ***
#   *
#  ***
# *****
x = int(input('Введіть непарне число: '))
if x % 2 == 0:
    print('ви ввели парне число!')
if x % 2 != 0:
    for i in range(x + 1):
        if i == 0 or i == x:
            print('*' * x)
        if i > 0 and i <= x // 2 :
            print(' ' * (i-1), '*' * ((x - i) - i))
        if i == (x // 2) + 1:
            i =+ 1
        if i > (x // 2) + 1 and i != x:
            print(' ' * ((x - i) - 1), '*' * ((-x + i) + i))


