# 1. Напишіть програму, яка порахує скільки літер «b» у введеному рядку тексту.
x = input('Введіть текс: ')
y = 0
for i in x:
    if i == 'b':
        y += 1
print(y)

#.2 Користувач вводить з клавіатури ім'я людини. Написати програму для перевірки введеного ім'я на валідність
# (мається на увазі, що, наприклад, в імені людини не може бути цифр, воно повинно починатися з великої літери, за якою повинні йти маленькі).
x = input('Ім\'я: ')
j = 0
if x[0].isupper():
    for i in x[1:]:
        if not i.islower() or i.isnumeric():
            print('Валідність не пройденна')
            break
        j += 1
        if j == len(x)-1:
            print('Вітаю все вірно!')
            break
else:
    print('Валідність не пройденна')

# 3. Напишіть програму, яка обчислить суму всіх кодів символів рядка.
x = input('Текст: ')
y = 0
for i in x:
    y += ord(i)
print(y)

# 4. Виведіть на екран 10 рядків із значенням числа Pi. У першому рядку має бути 2 знаки після коми, у другому 3 і так далі.
import math
x = math.pi
for i in range(10):
    print(round(x, 2 + i))
#5. Вводиться з клавіатури користувачем текст. Знайти в ньому найдовше слово та вивести його на екран
y = (input('Text: ')).split(' ')
c = []
for i in y:
    j = len(y[y.index(i)])
    c.append(j)
print(y[c.index(max(c))])

#Додаткові задачі до домашнього завдання:

# 1. Вовочка, сидячи на уроці, писав поспіль однакові слова (слово може складатися з однієї літери).
# Коли Марія Іванівна забрала у нього зошит, там був один рядок тексту.
# Напишіть програму, яка визначить найкоротше слово з написаних Вовочкою. Наприклад:
# aaaaaaa - Вовочка писав слово - "a"
# ititititit - Вовочка писав слово - "it"
# catcatcatcat - Вовочка писав слово - "cat"

x = list(input('Text: '))
y = [x[0]]
for i in range(len(x)):
    if x[0] != x[i+1] or x[1] != x[i+2]:
        y.append(x[i+1])
    if x[0] == x[i+1] and x[1] == x[i+2]:
        break
print(''.join(y))

# 2. Напишіть програму для очищення тексту від HTML-тегів. Більше про html-теги https://html5book.ru/html-tags/
# Також необхідно врахувати кілька особливостей:
# - крім одинарних тегів є парні теги, наприклад <div> </div>, тобто. перший тег відкриває, а другий закриває.
# - тег у собі може містити купу додаткової інформації. Наприклад <div id="rcnt" style="clear:both;position:relative;zoom:1">

x = '<div id="rcnt" style="clear:both;position:relative;zoom:1">перший тег відкриває, а другий закриває.</div><div> очищення тексту</div>'
y = []
for i in range(len(x)-1):
    if x[i] == '>':
        while x[i] != '<':
            i += 1
            if x[i] != '<':
                y.append(x[i])
print(''.join(y[:-1]))